mobizt/Firebase-ESP8266/src/FirebaseESP8266.h
  /*
    Set the virtual child node ".priority" to the defined database path. 
    
    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Target database path which to set the priority value.
    @param priority - The priority value.
    
    @return - Boolean type status indicates the success of the operation.

    This allows us to set priority to any node other than a priority that set through setJSON, pushJSON, updateNode, and updateNodeSilent functions.
    
    The returned priority value from server can read from function [FirebaseData object].priority().

   */
  bool setPriority(FirebaseData &dataObj, const String &path, float priority);

  /*
    Read the virtual child node ".priority" value at the defined database path. 
    
    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Target database path which to set the priority value.
    
    @return - Boolean type status indicates the success of the operation.

    The priority value from server can read from function [FirebaseData object].priority().

   */
  bool getPriority(FirebaseData &dataObj, const String &path);

  /*
    Append new integer value to the defined database path.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Target database path which integer value will be appended.
    @param intValue - The appended value.

    @return - Boolean type status indicates the success of the operation.

    The new appended node's key will be stored in Firebase Data object,
    which its value can be accessed via function [FirebaseData object].pushName().

  */
  bool pushInt(FirebaseData &dataObj, const String &path, int intValue);

  bool push(FirebaseData &dataObj, const String &path, int intValue);

  /*

    Append new integer value and the virtual child ".priority" to the defined database path.

  */
  bool pushInt(FirebaseData &dataObj, const String &path, int intValue, float priority);

  bool push(FirebaseData &dataObj, const String &path, int intValue, float priority);

  /*
    Append new float value to the defined database path.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Target database path in which float value will be appended.
    @param floatValue - The appended value.

    @return - Boolean type status indicates the success of the operation.

    The new appended node's key will be stored in Firebase Data object,
    which its value can be accessed via function [FirebaseData object].pushName().

  */
  bool pushFloat(FirebaseData &dataObj, const String &path, float floatValue);

  bool push(FirebaseData &dataObj, const String &path, float floatValue);

  /*

    Append new float value and the virtual child ".priority" to the defined database path.

  */
  bool pushFloat(FirebaseData &dataObj, const String &path, float floatValue, float priority);

  bool push(FirebaseData &dataObj, const String &path, float floatValue, float priority);

  /*
    Append new double value (8 bytes) to the defined database path.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Target database path in which float value will be appended.
    @param doubleValue - The appended value.

    @return - Boolean type status indicates the success of the operation.

    The new appended node's key will be stored in Firebase Data object,
    which its value can be accessed via function [FirebaseData object].pushName().

  */
  bool pushDouble(FirebaseData &dataObj, const String &path, double doubleValue);

  bool push(FirebaseData &dataObj, const String &path, double doubleValue);

  /*

    Append new double value (8 bytes) and the virtual child ".priority" to the defined database path.

  */
  bool pushDouble(FirebaseData &dataObj, const String &path, double doubleValue, float priority);

  bool push(FirebaseData &dataObj, const String &path, double doubleValue, float priority);

  /*
    Append new Boolean value to the defined database path.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Target database path which Boolean value will be appended.
    @param boolValue - The appended value.

    @return - Boolean type status indicates the success of the operation.

    The new appended node's key will be stored in Firebase Data object,
    which its value can be accessed via function [FirebaseData object].pushName().

  */
  bool pushBool(FirebaseData &dataObj, const String &path, bool boolValue);

  bool push(FirebaseData &dataObj, const String &path, bool boolValue);

  /*

    Append the new Boolean value and the virtual child ".priority" to the defined database path.

  */
  bool pushBool(FirebaseData &dataObj, const String &path, bool boolValue, float priority);

  bool push(FirebaseData &dataObj, const String &path, bool boolValue, float priority);

  /*
    Append a new string (text) to the defined database path.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Target database path which string will be appended.
    @param StringValue - The appended value.

    @return - Boolean type status indicates the success of the operation.

    The new appended node's key stored in Firebase Data object,
    which can be accessed via function [FirebaseData object].pushName().

  */
  bool pushString(FirebaseData &dataObj, const String &path, const String &stringValue);

  bool push(FirebaseData &dataObj, const String &path, const char *stringValue);

  bool push(FirebaseData &dataObj, const String &path, const String &stringValue);

  bool push(FirebaseData &dataObj, const String &path, const StringSumHelper &stringValue);

  /*

    Append new string (text) and the virtual child ".priority" to the defined database path.

  */
  bool pushString(FirebaseData &dataObj, const String &path, const String &stringValue, float priority);

  bool push(FirebaseData &dataObj, const String &path, const char *stringValue, float priority);

  bool push(FirebaseData &dataObj, const String &path, const String &stringValue, float priority);

