mobizt/Firebase-ESP8266/src/FirebaseESP8266.h
  bool push(FirebaseData &dataObj, const String &path, const StringSumHelper &stringValue, float priority);

  /*
    Append new child nodes key and value (using FirebaseJson object) to the defined database path.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Target database path which key and value in FirebaseJson object will be appended.
    @param json - The appended FirebaseJson object.

    @return - Boolean type status indicates the success of the operation.

    The new appended node key will be stored in Firebase Data object,
    which its value can be accessed via function [FirebaseData object].pushName().

  */
  bool pushJSON(FirebaseData &dataObj, const String &path, FirebaseJson &json);

  bool push(FirebaseData &dataObj, const String &path, FirebaseJson &json);

  /*

    Append new child node key and value (FirebaseJson object) and the virtual child ".priority" to the defined database path.

  */

  bool pushJSON(FirebaseData &dataObj, const String &path, FirebaseJson &json, float priority);

  bool push(FirebaseData &dataObj, const String &path, FirebaseJson &json, float priority);

  /*

    Append child node array (using FirebaseJsonArray object) to the defined database path.

    This will replace any child nodes inside the defined path with array defined in FirebaseJsonArray object.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Target database path which key and value in FirebaseJsonArray object will be appended.
    @param arr - The appended FirebaseJsonArray object.

    @return - Boolean type status indicates the success of the operation.

    The new appended node's key will be stored in Firebase Data object,
    which its value can be accessed via function [FirebaseData object].pushName().

  */
  bool pushArray(FirebaseData &dataObj, const String &path, FirebaseJsonArray &arr);

  bool push(FirebaseData &dataObj, const String &path, FirebaseJsonArray &arr);

  /*

    Append FirebaseJsonArray object and virtual child ".priority" at the defined database path.

  */

  bool pushArray(FirebaseData &dataObj, const String &path, FirebaseJsonArray &arr, float priority);

  bool push(FirebaseData &dataObj, const String &path, FirebaseJsonArray &arr, float priority);

  /*
    Append new blob (binary data) to the defined database path.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Target database path which binary data will be appended.
    @param blob - Byte array of data.
    @param size - Size of the byte array.

    @return - Boolean type status indicates the success of the operation.

    The new appended node's key will be stored in Firebase Data object,
    which its value can be accessed via function [FirebaseData object].pushName().

  */
  bool pushBlob(FirebaseData &dataObj, const String &path, uint8_t *blob, size_t size);

  bool push(FirebaseData &dataObj, const String &path, uint8_t *blob, size_t size);

  /*

    Append new blob (binary data) and the virtual child ".priority" to the defined database path.

  */
  bool pushBlob(FirebaseData &dataObj, const String &path, uint8_t *blob, size_t size, float priority);

  bool push(FirebaseData &dataObj, const String &path, uint8_t *blob, size_t size, float priority);

  /*
    Append new binary data from the file stores on SD card/Flash memory to the defined database path.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param storageType - Type of storage to read file data, StorageType::SPIFS or StorageType::SD.
    @param path - Target database path in which binary data from the file will be appended.
    @param fileName - File name included its path in SD card/Flash memory.

    @return - Boolean type status indicates the success of the operation.

    The new appended node's key will be stored in Firebase Data object,
    which its value can be accessed via function [FirebaseData object].pushName().

  */
  bool pushFile(FirebaseData &dataObj, uint8_t storageType, const String &path, const String &fileName);

  bool push(FirebaseData &dataObj, uint8_t storageType, const String &path, const String &fileName);

  /*

    Append new binary data from the file stores on SD card/Flash memory and the virtual child ".priority" to the defined database path.

  */
  bool pushFile(FirebaseData &dataObj, uint8_t storageType, const String &path, const String &fileName, float priority);

  bool push(FirebaseData &dataObj, uint8_t storageType, const String &path, const String &fileName, float priority);

  /*
    Append the new Firebase server's timestamp to the defined database path.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Target database path which timestamp will be appended.

    @return - Boolean type status indicates the success of the operation.
    
    The new appended node's key will be stored in Firebase Data object, 
    which its value can be accessed via function [FirebaseData object].pushName().

   */
  bool pushTimestamp(FirebaseData &dataObj, const String &path);

  /*
    Set integer data at the defined database path.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Target database path which integer data will be set.
    @param intValue - Integer value to set.

    @return - Boolean type status indicates the success of the operation.

    Call [FirebaseData object].dataType to determine what type of data that successfully stores in the database.

    Call [FirebaseData object].intData will return the integer value of
    payload returned from server.

  */
  bool setInt(FirebaseData &dataObj, const String &path, int intValue);

  bool set(FirebaseData &dataObj, const String &path, int intValue);



  /*

    Set integer data and virtual child ".priority" at the defined database path.

  */
  bool setInt(FirebaseData &dataObj, const String &path, int intValue, float priority);

  bool set(FirebaseData &dataObj, const String &path, int intValue, float priority);

