mobizt/Firebase-ESP8266/src/FirebaseESP8266.h
    Call [FirebaseData object].intData will return the integer value of timestamp in seconds
    or [FirebaseData object].doubleData to get millisecond timestamp.

    Due to bugs in Serial.print in Arduino, to print large double value with zero decimal place, 
    use printf("%.0lf\n", firebaseData.doubleData());.

   */
  bool setTimestamp(FirebaseData &dataObj, const String &path);

  /*
    Update the child node key or existing key's value (using FirebaseJson object) under the defined database path.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Target database path which key and value in FirebaseJson object will be updated.
    @param json - The FirebaseJson object used for the update.

    @return - Boolean type status indicates the success of the operation.

    Call [FirebaseData object].dataType to determine what type of data successfully stores in the database.

    Call [FirebaseData object].jsonData will return the json string value of
    payload returned from server.

    To reduce network data usage, use updateNodeSilent instead.

  */
  bool updateNode(FirebaseData &dataObj, const String path, FirebaseJson &json);

  /*

    Update child node key or existing key's value and virtual child ".priority" (using JSON data or FirebaseJson object) under the defined database path.

  */

  bool updateNode(FirebaseData &dataObj, const String &path, FirebaseJson &json, float priority);

  /*
    Update the child node key or existing key's value (using FirebaseJson object) under the defined database path.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Target database path which key and value in FirebaseJson object will be updated.
    @param json - The FirebaseJson object used for the update.

    @return - Boolean type status indicates the success of the operation.

    Owing to the objective of this function to reduce network data usage,
    no payload will be returned from the server.

  */
  bool updateNodeSilent(FirebaseData &dataObj, const String &path, FirebaseJson &json);

  /*

    Update child node key or existing key's value and virtual child ".priority" (using JSON data or FirebaseJson object) under the defined database path.

  */

  bool updateNodeSilent(FirebaseData &dataObj, const String &path, FirebaseJson &json, float priority);

  /*
    Read any type of value at the defined database path.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Database path in which the float value is being read.

    @return - Boolean type status indicates the success of the operation.

    Call [FirebaseData object].dataType to determine what type of data successfully stores in the database. 
    
    Call [FirebaseData object].intData, [FirebaseData object].floatData, [FirebaseData object].doubleData,
    [FirebaseData object].boolData, [FirebaseData object].stringData, [FirebaseData object].jsonObject (pointer), 
    [FirebaseData object].jsonArray (pointer) and [FirebaseData object].blobData corresponded to 
    its type from [FirebaseData object].dataType.

  */
  bool get(FirebaseData &dataObj, const String &path);

  /*
    Read the integer value at the defined database path.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Database path in which the float value is being read.

    @return - Boolean type status indicates the success of the operation.

    Call [FirebaseData object].dataType to determine what type of data successfully stores in the database. 
    
    Call [FirebaseData object].intData will return the integer value of
    payload returned from server.

    If the type of payload returned from server is not integer, float and double, 
    the function [FirebaseData object].intData will return zero (0).

  */
  bool getInt(FirebaseData &dataObj, const String &path);

  /*
    Read the integer value at the defined database path.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Database path in which the float value is being read.
    @param target - The integer type variable to store value.

    @return - Boolean type status indicates the success of the operation.

    If the type of payload returned from the server is not an integer, float and double, 
    the target variable's value will be zero (0).

  */
  bool getInt(FirebaseData &dataObj, const String &path, int &target);

  /*
    Read the float value at the defined database path.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Database path in which the float value is being read.

    @return - Boolean type status indicates the success of the operation.

    Call [FirebaseData object].dataType to determine what type of data successfully stores in the database. 
    
    Call [FirebaseData object].floatData will return the float value of
    payload returned from server.

    If the payload returned from server is not integer, float and double, 
    the function [FirebaseData object].floatData will return zero (0).

   */
  bool getFloat(FirebaseData &dataObj, const String &path);

  /*
    Read the float value at the defined database path.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Database path in which the float value is being read.
    @param target - The float type variable to store value.

    @return - Boolean type status indicates the success of the operation.


    If the type of payload returned from the server is not an integer, float and double, 
    the target variable's value will be zero (0).

   */
  bool getFloat(FirebaseData &dataObj, const String &path, float &target);

  /*
    Read the double value at the defined database path.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Database path in which the float value is being read.

    @return - Boolean type status indicates the success of the operation.

    Call [FirebaseData object].dataType to determine what type of data successfully stores in the database. 
    
    Call [FirebaseData object].doubleData will return the double value of
    the payload returned from the server.

