mobizt/Firebase-ESP8266/src/FirebaseESP8266.h
    @return Boolean type status indicates the success of the operation.

  */
  bool getFile(FirebaseData &dataObj, uint8_t storageType, const String &nodePath, const String &fileName);

  /*
    Delete all child nodes at the defined database path.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Database path to be deleted.

    @return - Boolean type status indicates the success of the operation.

  */
  bool deleteNode(FirebaseData &dataObj, const String &path);

  /*
    Delete all child nodes at the defined database path if defined database path's ETag matched the ETag value.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Database path to be deleted.
    @param ETag - Known unique identifier string (ETag) of defined database path.

    @return - Boolean type status indicates the success of the operation.

    If ETag at the defined database path does not match the provided ETag parameter,
    the operation will fail with HTTP code 412, Precondition Failed (ETag is not matched).

   */
  bool deleteNode(FirebaseData &dataObj, const String &path, const String &ETag);

  /*
    Start subscribe to the value changes at the defined path and its children.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param path - Database path to subscribe.

    @return - Boolean type status indicates the success of the operation.

  */
  bool beginStream(FirebaseData &dataObj, const String &path);

  /*
    Start subscribe to the value changes at the defined parent node path with multiple nodes paths parsing.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param parentPath - Database parent node path to subscribe.
    @param childPath - The string array of child nodes paths for parsing.
    @param size - The size of string array of child nodes paths for parsing.

    @return - Boolean type status indicates the success of the operation.

  */
  bool beginMultiPathStream(FirebaseData &dataObj, const String &parentPath, const String *childPath, size_t size);

  /*
    Read the stream event data at the defined database path.

    Once beginStream was called e.g. in setup(), the readStream function
    should call inside the loop function.

    @param dataObj - Firebase Data Object to hold data and instances.

    @return - Boolean type status indicates the success of the operation.

    Using the same Firebase Data object for stream read/monitoring associated
    with getXXX, setXXX, pushXXX, updateNode and deleteNode will break or quit
    the current stream connection.

    The stream will be resumed or reconnected automatically when calling readStream.

  */
  bool readStream(FirebaseData &dataObj);

  /*
    End the stream connection at a defined path.

    It can be restart again by calling beginStream.

    @param dataObj - Firebase Data Object to hold data and instances.

    @return - Boolean type status indicates the success of the operation.

  */
  bool endStream(FirebaseData &dataObj);

  /*
    Set the stream callback functions.

    setStreamCallback should be called before Firebase.beginStream.
    
    @param dataObj - Firebase Data Object to hold data and instances.
    @param dataAvailablecallback - a Callback function that accepts streamData parameter.
    @param timeoutCallback - Callback function will be called when the stream connection was timed out (optional).

    dataAvailablecallback will be called When data in the defined path changed or the stream path changed or stream connection
    was resumed from getXXX, setXXX, pushXXX, updateNode, deleteNode.

    The payload returned from the server will be one of these integer, float, string, JSON and blob types.

    Call [streamData object].dataType to determine what type of data successfully stores in the database. 
    
    Call [streamData object].xxxData will return the appropriate data type of
    the payload returned from the server.

   */
  void setStreamCallback(FirebaseData &dataObj, StreamEventCallback dataAvailablecallback, StreamTimeoutCallback timeoutCallback = NULL);
  
  
  /*
    Set the multiple paths stream callback functions.

    setMultiPathStreamCallback should be called before Firebase.beginMultiPathStream.
    
    @param dataObj - Firebase Data Object to hold data and instances.
    @param multiPathDataCallback - a Callback function that accepts MultiPathStreamData parameter.
    @param timeoutCallback - a Callback function will be called when the stream connection was timed out (optional).

    multiPathDataCallback will be called When data in the defined path changed or the stream path changed or stream connection
    was resumed from getXXX, setXXX, pushXXX, updateNode, deleteNode.

    The payload returned from the server will be one of these integer, float, string and JSON.

    Call [MultiPathStreamData object].get to get the child node value, type and data path. 
    
    The properties [MultiPathStreamData object].value, [MultiPathStreamData object].dataPath, and [MultiPathStreamData object].type will return the value, path of data, and type of data respectively.

    These properties will store the result from calling the function [MultiPathStreamData object].get.

   */
  void setMultiPathStreamCallback(FirebaseData &dataObj, MultiPathStreamEventCallback multiPathDataCallback, StreamTimeoutCallback timeoutCallback = NULL);



  /*
    Remove stream callback functions.

    @param dataObj - Firebase Data Object to hold data and instances.
   */
  void removeStreamCallback(FirebaseData &dataObj);

  /*
    Remove multiple paths stream callback functions.

    @param dataObj - Firebase Data Object to hold data and instances.
  */
  void removeMultiPathStreamCallback(FirebaseData &dataObj);

  /*
    Backup (download) database at the defined database path to SD card/Flash memory.

    @param dataObj - Firebase Data Object to hold data and instances.
    @param storageType - Type of storage to save file, StorageType::SPIFS or StorageType::SD.
    @param nodePath - Database path to be backuped.
    @param fileName - File name to save.
    
    Only 8.3 DOS format (max. 8 bytes file name and 3 bytes file extension) can be saved to SD card/Flash memory.

