mobizt/Firebase-ESP8266/src/FirebaseESP8266.h
  /*
    Send Firebase Cloud Messaging to the device with the first registration token which added by firebaseData.fcm.addDeviceToken.

    @param dataObj - Firebase Data Object to hold data and instances.

    @param index - The index (starts from 0) of recipient device token which added by firebaseData.fcm.addDeviceToken
    
    @return - Boolean type status indicates the success of the operation.

   */
  bool sendMessage(FirebaseData &dataObj, uint16_t index);

  /*
    Send Firebase Cloud Messaging to all devices (multicast) which added by firebaseData.fcm.addDeviceToken.

    @param dataObj - Firebase Data Object to hold data and instances.
    
    @return - Boolean type status indicates the success of the operation.

   */
  bool broadcastMessage(FirebaseData &dataObj);

  /*
    Send Firebase Cloud Messaging to devices that subscribed to the topic.

    @param dataObj - Firebase Data Object to hold data and instances.
    
    @return - Boolean type status indicates the success of the operation.

   */
  bool sendTopic(FirebaseData &dataObj);

  void errorToString(int httpCode, std::string &buff);

  template <typename T>
  bool set(FirebaseData &dataObj, const String &path, T value);

  template <typename T>
  bool set(FirebaseData &dataObj, const String &path, T value, size_t size);

  template <typename T>
  bool set(FirebaseData &dataObj, const String &path, T value, float priority);

  template <typename T>
  bool set(FirebaseData &dataObj, const String &path, T value, size_t size, float priority);

  template <typename T>
  bool set(FirebaseData &dataObj, const String &path, T value, const String &ETag);

  template <typename T>
  bool set(FirebaseData &dataObj, const String &path, T value, size_t size, const String &ETag);

  template <typename T>
  bool set(FirebaseData &dataObj, const String &path, T value, float priority, const String &ETag);

  template <typename T>
  bool set(FirebaseData &dataObj, const String &path, T value, size_t size, float priority, const String &ETag);

  template <typename T>
  bool push(FirebaseData &dataObj, const String &path, T value);

  template <typename T>
  bool push(FirebaseData &dataObj, const String &path, T value, size_t size);

  template <typename T>
  bool push(FirebaseData &dataObj, const String &path, T value, float priority);

  template <typename T>
  bool push(FirebaseData &dataObj, const String &path, T value, size_t size, float priority);
  

private:
  callback_function_t _callback_function = nullptr;

  bool pushInt(FirebaseData &dataObj, const std::string &path, int intValue, bool queue, const std::string &priority);
  bool pushFloat(FirebaseData &dataObj, const std::string &path, float floatValue, bool queue, const std::string &priority);
  bool pushDouble(FirebaseData &dataObj, const std::string &path, double doubleValue, bool queue, const std::string &priority);
  bool pushBool(FirebaseData &dataObj, const std::string &path, bool boolValue, bool queue, const std::string &priority);
  bool pushBlob(FirebaseData &dataObj, const std::string &path, uint8_t *blob, size_t size, bool queue, const std::string &priority);
  bool setInt(FirebaseData &dataObj, const std::string &path, int intValue, bool queue, const std::string &priority, const std::string &etag);
  bool setFloat(FirebaseData &dataObj, const std::string &path, float floatValue, bool queue, const std::string &priority, const std::string &etag);
  bool setDouble(FirebaseData &dataObj, const std::string &path, double doubleValue, bool queue, const std::string &priority, const std::string &etag);
  bool setBool(FirebaseData &dataObj, const std::string &path, bool boolValue, bool queue, const std::string &priority, const std::string &etag);
  bool setBlob(FirebaseData &dataObj, const std::string &path, uint8_t *blob, size_t size, bool queue, const std::string &priority, const std::string &etag);

  void getUrlInfo(const std::string url, std::string &host, std::string &uri, std::string &auth);
  bool buildRequest(FirebaseData &dataObj, uint8_t firebaseMethod, uint8_t firebaseDataType, const std::string &path, const char *buff, bool queue, const std::string &priority, const std::string &etag = "");
  bool buildRequestFile(FirebaseData &dataObj, uint8_t storageType, uint8_t firebaseMethod, const std::string &path, const std::string &fileName, bool queue, const std::string &priority, const std::string &etag = "");
  bool sendRequest(FirebaseData &dataObj, uint8_t storageType, const std::string &path, const uint8_t method, uint8_t dataType, const std::string &payload, const std::string &priority, const std::string &etag);
  void buildFirebaseRequest(std::string &buf, FirebaseData &dataObj, const char *host, uint8_t method, uint8_t dataType, const char *path, const char *auth, size_t payloadLength, bool sv, bool send);
  void endFileTransfer(FirebaseData &dataObj);
  bool firebaseConnectStream(FirebaseData &dataObj, const std::string &path);
  bool getServerStreamResponse(FirebaseData &dataObj);

  bool getServerResponse(FirebaseData &dataObj);
  bool getDownloadResponse(FirebaseData &dataObj);
  bool getUploadResponse(FirebaseData &dataObj);
  bool clientAvailable(FirebaseData &dataObj, bool available);

  void sendHeader(FirebaseData &dataObj, const char *host, uint8_t _method, const char *path, const char *auth, size_t payloadLength);
  void resetFirebasedataFlag(FirebaseData &dataObj);
  bool handleNetClientNotConnected(FirebaseData &dataObj);
  bool reconnect(FirebaseData &dataObj);
  bool reconnect();
  void forceEndHTTP(FirebaseData &dataObj);
  bool apConnected(FirebaseData &dataObj);
  int firebaseConnect(FirebaseData &dataObj, const std::string &path, const uint8_t method, uint8_t dataType, const std::string &payload, const std::string &priority);
  bool cancelCurrentResponse(FirebaseData &dataObj);
  void setDataType(FirebaseData &dataObj, const char *data);
  void setSecure(FirebaseData &dataObj);
  bool commError(FirebaseData &dataObj);
  uint8_t openErrorQueue(FirebaseData &dataObj, const String &filename, uint8_t storageType, uint8_t mode);
  std::vector<std::string> splitString(int size, const char *str, const char delim);
  void delPtr(char *p);
  char *newPtr(size_t len);
  char *newPtr(char *p, size_t len);
  char *newPtr(char *p, size_t len, char *d);

  void processFirebaseStream();
  void processAllErrorQueues();

  void p_memCopy(std::string &buff, PGM_P p, bool empty = false);
  char *getPGMString(PGM_P pgm);
  void getPGMString(char *buf, PGM_P pgm, bool empty = false);
  char *getFloatString(float value);
  char *getDoubleString(double value);
  char *getIntString(int value);
  char *getBoolString(bool value);
  void trimDouble(char *buf);
  bool sdTest();
  void createDirs(std::string dirs, uint8_t storageType);
  bool replace(std::string &str, const std::string &from, const std::string &to);
  std::string base64_encode_string(const unsigned char *src, size_t len);
  void send_base64_encode_file(SSL_CLIENT *ssl_client, const std::string &filePath, uint8_t storageType);
  bool base64_decode_string(const std::string src, std::vector<uint8_t> &out);
  bool base64_decode_file(File &file, const char *src, size_t len);
  bool base64_decode_SPIFFS(fs::File &file, const char *src, size_t len);

  bool sendFCMMessage(FirebaseData &dataObj, uint8_t messageType);

  void strcat_c(char *str, char c);
  int strpos(const char *haystack, const char *needle, int offset);
  int rstrpos(const char *haystack, const char *needle, int offset);
  char *rstrstr(const char *haystack, const char *needle);
  void setClock(float offset);

  void set_scheduled_callback(callback_function_t callback)
  {
    _callback_function = std::move([callback]() { schedule_function(callback); });
    _callback_function();
  }

  std::string _host = "";
  std::string _auth = "";
  std::string _rootCAFile = "";
  uint8_t _rootCAFileStoreageType = StorageType::SPIFFS;
  uint16_t _port = 443;
  uint8_t _sdPin = 15;
  std::shared_ptr<const char> _rootCA = nullptr;
  bool _reconnectWiFi = false;
  bool _sdOk = false;
  bool _sdInUse = false;
  bool _clockReady = false;
  unsigned long _lastReconnectMillis = 0;
  uint16_t _reconnectTimeout = 10000;
  File file;
  fs::File _file;
  float _gmtOffset = 0.0;
};

class FirebaseData
{

