mobizt/Firebase-ESP8266/src/FirebaseESP8266.h
  /*

    Determine the HTTP status code return from the server.

    @return integer number of HTTP status.

  */
  int httpCode();

  /*

    Check the overflow of the returned payload data buffer.

    @return The overflow status.

    Total default HTTP response buffer size is 400 bytes which can be set through FirebaseData.setResponseSize.

  */
  bool bufferOverflow();

  /*

    Determine the name (full path) of the backup file in SD card/Flash memory.

    @return String (String object) of the file name that stores on SD card/Flash memory after backup operation.

  */
  String getBackupFilename();

  /*

    Determine the size of the backup file.

    @return Size of backup file in byte after backup operation.

  */
  size_t getBackupFileSize();

  /*

    Clear or empty data in Firebase Data object.

  */
  void clear();

  /*
    Determine the error description for file transferring (pushFile, setFile, backup and restore).

    @return Error description string (String object).

  */
  String fileTransferError();

  /*
    Return the server's payload data.

    @return Payload string (String object).

  */
  String payload();

  FCMObject fcm;

  QueryFilter queryFilter;

  friend class QueueManager;

private:
  FirebaseESP8266::StreamEventCallback _dataAvailableCallback = NULL;
  FirebaseESP8266::MultiPathStreamEventCallback _multiPathDataCallback = NULL;
  FirebaseESP8266::StreamTimeoutCallback _timeoutCallback = NULL;
  FirebaseESP8266::QueueInfoCallback _queueInfoCallback = NULL;

  int _index = -1;
  int _Qindex = -1;

  FirebaseHTTPClient _net;
  bool _firebaseCall = false;
  bool _streamCall = false;
  bool _fcmCall = false;
  bool _isStreamTimeout = false;
  bool _isStream = false;
  bool _streamStop = false;
  bool _isSilentResponse = false;
  bool _bufferOverflow = false;
  bool _streamDataChanged = false;
  bool _streamPathChanged = false;
  bool _dataAvailable = false;
  bool _keepAlive = false;
  bool _httpConnected = false;
  bool _interruptRequest = false;
  bool _mismatchDataType = false;
  bool _pathNotExist = false;
  bool _pause = false;
  bool _file_transfering = false;
  bool _classicRequest = false;
  int _dataType = 0;
  int _dataType2 = 0;
  uint8_t _dataTypeNum = 0;
  uint8_t _connectionStatus = 0;
  uint32_t _qID = 0;
  QueueManager _qMan;
  uint8_t _maxRetry = 0;
  uint8_t _r_method = 0;
  uint8_t _r_dataType = 0;
  uint8_t _storageType = 0;
  uint8_t _redirectCount = 0;
  int _redirect = 0;

  std::string _path = "";
  std::string _data = "";
  std::string _data2 = "";
  std::string _streamPath = "";
  std::string _pushName = "";
  std::string _file_transfer_error = "";
  std::string _fileName = "";
  std::string _redirectURL = "";
  std::string _firebaseError = "";
  std::string _eventType = "";
  std::string _etag = "";
  std::string _etag2 = "";
  std::string _priority = "";
  FirebaseJson _json;
  FirebaseJsonArray _jsonArr;
  FirebaseJsonData _jsonData;

  uint16_t _maxBlobSize = 1024;
  uint16_t _bsslRxSize = 512;
  uint16_t _bsslTxSize = 512;
  uint16_t _responseBufSize = 400;
  unsigned long _streamTimeoutMillis = 0;

  std::vector<uint8_t> _blob = std::vector<uint8_t>();
  std::vector<std::string> _childNodeList = std::vector<std::string>();

  int _httpCode = -1000;
  int _contentLength = 0;

  bool _priority_val_flag = false;
  bool _priority_json_flag = false;
  bool _shallow_flag = false;
  int _readTimeout = -1;
  std::string _writeLimit = "";

  unsigned long _dataMillis = 0;
  unsigned long _streamMillis = 0;
  unsigned long _streamResetMillis = 0;

  std::string _backupNodePath = "";
  std::string _backupDir = "";
  std::string _backupFilename = "";
  size_t _backupFileSize = 0;

  std::string getDataType(uint8_t type);
  std::string getMethod(uint8_t method);

  void addQueue(uint8_t firebaseMethod,
                uint8_t storageType,
                uint8_t firebaseDataType,
                const std::string path,
                const std::string filename,
                const std::string payload,
                bool isQuery,
                int *intTarget,
                float *floatTarget,
                double *doubleTarget,
                bool *boolTarget,
                String *stringTarget,
                std::vector<uint8_t> *blobTarget,
                FirebaseJson *jsonTarget,
                FirebaseJsonArray *arrTarget);

  void clearQueueItem(QueueItem &item);

  void setQuery(QueryFilter &query);

  void clearNodeList();

  void addNodeList(const String *childPath, size_t size);

  friend class FirebaseESP8266;
};

class StreamData
{

public:
  StreamData();
  ~StreamData();
  String dataPath();
  String streamPath();
  int intData();
  float floatData();
  double doubleData();
  bool boolData();
  String stringData();
  String jsonString();
  FirebaseJson *jsonObjectPtr();
  FirebaseJson &jsonObject();
  FirebaseJsonArray *jsonArrayPtr();
  FirebaseJsonArray &jsonArray();
  FirebaseJsonData *jsonDataPtr();
  FirebaseJsonData &jsonData();
  String dataType();
  String eventType();
  void empty();
  friend FirebaseESP8266;
  FirebaseJson *_json = nullptr;
  FirebaseJsonArray *_jsonArr = nullptr;
  FirebaseJsonData *_jsonData = nullptr;

private:
  std::string _streamPath = "";
  std::string _path = "";
  std::string _data = "";
  std::vector<uint8_t> _blob = std::vector<uint8_t>();
  std::string _dataTypeStr = "";
  std::string _eventTypeStr = "";
  uint8_t _dataType = 0;
};

class MultiPathStreamData
{
  friend class FirebaseESP8266;
public:
  MultiPathStreamData();
  ~MultiPathStreamData();
  bool get(const String &path);
  String dataPath;
  String value;
  String type;
  
private:
  uint8_t _type = 0;
  std::string _data = "";
  std::string _path = "";
  std::string _typeStr = "";
  FirebaseJson *_json = nullptr;

  void empty();
};

extern FirebaseESP8266 Firebase;


#endif /* ESP8266 */

#endif /* FirebaseESP8266_H */